<?php
return array(
    //'配置项'=>'配置值'
    'DB_TYPE' => 'mysql', // 数据库类型
    'DB_HOST' => 'localhost', // 服务器地址
    'DB_NAME' => 'honeypot', // 数据库名
    'DB_USER' => 'root', // 用户名
    'DB_PWD' => '', // 密码
    'DB_PORT' => 3306, // 端口
    'DB_PREFIX' => '', // 数据库表前缀
    'DB_CHARSET'=> 'utf8mb4', // 字符集
    'DB_DEBUG' => TRUE, // 数据库调试模式 开启后可以记录SQL日志 3.2.3新增

    /****************************不需要权限验证的方法**********************************/
    "ALLOWMEDTH" =>array(
        'Admin/admin',
        'Admin/loginOut',
        'Admin/adminList',
        'Admin/saveAdminStatus',
        'Admin/saveGroupStatus',
        'Admin/createRule',
    ),

    //返回码
    'CODE' => array(
        //登录的时候要用
        '101' => '用户名或密码错误',
        '102' => '手机号码不正确',
        '103' => '验证码发送失败',
        '104' => '验证码发送频繁',
        '105' => '验证码已过期',
        '106' => '验证码不正确',
        '107' => '你的验证码已用完,请明天在来!',
        '108' => '登录失败',
        '109' => '参数验证失败',
        '110' => '当前网络不稳定，请稍后再试。',
        '111' => '该账户已登录',
        '112' => '用户不存在',
        '113' => 'TOKEN不存在',
        '115' => '密码为空',
        '116' => '该电话号码已经注册，请直接登录。',
        '118' => '账号或密码错误',
        '803' => '密码修改失败！',
        '804' => '该真相已经被升级为此刻在，不允许删除！',
    ),
);